GD32-MCU-IOT/gd32_nuttx/boards/arm/gd32e11x/gd32e113vb-eval/src/gd32e11x_bringup.c
/****************************************************************************
 * boards/arm/gd32e11x/gd32e113vb-eval/src/gd32e11x_bringup.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdbool.h>
#include <stdio.h>
#include <debug.h>
#include <errno.h>
#include <sys/stat.h>

#include <nuttx/board.h>
#include <nuttx/clock.h>
#include <nuttx/fs/fs.h>

#ifdef CONFIG_SPI
#  include <nuttx/spi/spi.h>
#  include <nuttx/spi/spi_transfer.h>
#endif

#include "gd32e11x.h"

#if defined(CONFIG_GD32E11X_FWDGT) || defined(CONFIG_GD32E11X_WWDG)
#  include "gd32e11x_wdg.h"
#endif

#ifdef CONFIG_GD32E11X_CRC
#  include "gd32e11x_crc.h"
#endif

#ifdef CONFIG_ADC
#  include <nuttx/analog/adc.h>
#endif

#ifdef CONFIG_USERLED
#  include <nuttx/leds/userled.h>
#endif

#ifdef CONFIG_INPUT_BUTTONS
#  include <nuttx/input/buttons.h>
#endif

#ifdef  CONFIG_RTC_DRIVER
#include <nuttx/timers/rtc.h>
#endif

#include "gd32e113v_eval.h"
#ifdef CONFIG_GD32E11X_USBFS
#  include "gd32e11x_usbfs.h"
#endif

#ifdef CONFIG_EXAMPLES_CUSTOM_HID
extern int custom_hid_main(int argc, FAR char *argv[]);
#endif

#include "gd32e113v_eval.h"

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_bringup
 *
 * Description:
 *   Perform architecture-specific initialization
 *
 *   CONFIG_BOARD_LATE_INITIALIZE=y :
 *     Called from board_late_initialize().
 *
 *   CONFIG_BOARD_LATE_INITIALIZE=n && CONFIG_BOARDCTL=y :
 *     Called from the NSH library via boardctl()
 *
 ****************************************************************************/

int gd32_bringup(void)
{
  int ret = OK;
  static bool initialized = false;

  /* Prevent multiple initialization */

  if (initialized)
    {
      return OK;
    }

  initialized = true;

#ifdef CONFIG_FS_PROCFS
  /* Mount the procfs file system */

  /* Create the mount point directory if it doesn't exist */

  ret = mkdir(GD32_PROCFS_MOUNTPOINT, 0755);
  if (ret < 0 && errno != EEXIST)
    {
      syslog(LOG_ERR, "ERROR: Failed to create %s: %d\n",
             GD32_PROCFS_MOUNTPOINT, errno);
    }

  ret = nx_mount(NULL, GD32_PROCFS_MOUNTPOINT, "procfs", 0, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to mount procfs at %s: %d\n",
             GD32_PROCFS_MOUNTPOINT, ret);
    }
  else
    {
      syslog(LOG_INFO, "INFO: procfs mounted at %s\n",
             GD32_PROCFS_MOUNTPOINT);
    }
#endif

#ifdef CONFIG_USERLED
  /* Register the LED driver */

  ret = userled_lower_initialize(LED_DRIVER_PATH);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: userled_lower_initialize() failed: %d\n",
             ret);
    }
#endif

#ifdef CONFIG_INPUT_BUTTONS
  /* Register the BUTTON driver */

  ret = btn_lower_initialize("/dev/buttons");
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: btn_lower_initialize() failed: %d\n", ret);
    }
#endif

#ifdef CONFIG_GD32E11X_FWDGT
  /* Initialize the FWDGT watchdog timer.
   * IRC40K frequency: nominally 40kHz, can vary from 28kHz to 60kHz.
   * For safety, use nominal 40kHz value.
   */

  gd32_fwdgt_initialize("/dev/watchdog0", 40000);
#endif

#ifdef CONFIG_GD32E11X_WWDG
  /* Initialize the WWDGT watchdog timer */

  gd32_wwdg_initialize("/dev/watchdog1");
#endif

#ifdef CONFIG_GD32E113VB_EVAL_WDG_THREAD
  /* Start watchdog kicker thread */

  ret = gd32_watchdog_initialize();
  if (ret != OK)
    {
      syslog(LOG_ERR, "ERROR: Failed to start watchdog thread: %d\n", ret);
      return ret;
    }
#endif

#if defined(CONFIG_WATCHDOG) && defined(CONFIG_GD32E11X_WWDG)
  /* Test WWDGT window watchdog */

  syslog(LOG_INFO, "INFO: Testing WWDGT...\n");
  ret = gd32_wwdgt_test();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: WWDGT test failed: %d\n", ret);
    }
  else
    {
      syslog(LOG_INFO, "INFO: WWDGT test passed\n");
    }
#endif

#ifdef CONFIG_DEV_GPIO
  /* Initialize GPIO character devices */

  ret = gd32_gpio_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_gpio_initialize() failed: %d\n", ret);
    }
#endif

#ifdef HAVE_GD25
  /* Initialize and mount the GD25 SPI flash */

  syslog(LOG_INFO, "INFO: Initializing GD25 SPI Flash...\n");
  ret = gd32_gd25_automount(0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_gd25_automount() failed: %d\n", ret);
    }
#endif

#ifdef HAVE_PROGMEM
  ret = gd32_progmem_automount(0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_progmem_automount() failed: %d\n", ret);
    }
#endif

#ifdef HAVE_AT24
  /* I2C EEPROM write and read test */

  ret = gd32_at24_wr_test(AT24_MINOR);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: I2C EEPROM write and read test fail: %d\n",
             ret);
    }

#  ifdef CONFIG_GD32E11X_I2C_DMA
  /* Multi-message DMA test */

  ret = gd32_at24_multimsg_dma_test(AT24_MINOR);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Multi-message DMA test fail: %d\n", ret);
    }
#  endif
#endif

#ifdef CONFIG_SPI
  /* Initialize SPI-based devices */

#ifdef CONFIG_GD32E11X_SPI1
  struct spi_dev_s *spi1 = gd32_spibus_initialize(1);
  if (spi1)
    {
#ifdef CONFIG_SPI_DRIVER
      ret = spi_register(spi1, 1);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI1: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI1 registered as /dev/spi1\n");
        }
#endif
    }
  else
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize SPI1\n");
    }
#endif

#ifdef CONFIG_GD32E11X_SPI2
  struct spi_dev_s *spi2 = gd32_spibus_initialize(2);
  if (spi2)
    {
#ifdef CONFIG_SPI_DRIVER
      ret = spi_register(spi2, 2);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to register SPI2: %d\n", ret);
        }
      else
        {
          syslog(LOG_INFO, "SPI2 registered as /dev/spi2\n");
        }
#endif
    }
  else
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize SPI2\n");
    }
#endif
#endif

#ifdef CONFIG_GD32E11X_CRC
  /* Initialize CRC hardware and run tests */

  gd32_crc_init();
  syslog(LOG_INFO, "INFO: CRC hardware initialized\n");

  /* Run CRC test if enabled */

  ret = gd32_crc_test();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: CRC test failed: %d\n", ret);
    }
#endif

#if defined(CONFIG_ADC) && \
    (defined(CONFIG_GD32E11X_ADC0) || defined(CONFIG_GD32E11X_ADC1))
  /* Initialize ADC and register the ADC driver */

  ret = gd32_adc_setup();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_adc_setup() failed: %d\n", ret);
    }
#endif

#if defined(CONFIG_DAC) && defined(CONFIG_GD32E11X_DAC)
  /* Initialize DAC and register the DAC device(s) */

  ret = gd32_dac_setup();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_dac_setup() failed: %d\n", ret);
    }
#endif

#ifdef CONFIG_PWM
  /* Initialize PWM and register the PWM device */

  ret = gd32_pwm_setup();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_pwm_setup() failed: %d\n", ret);
    }
#endif

#ifdef CONFIG_TIMER
  /* Initialize Timer and register the timer device */

  ret = gd32_timer_driver_setup(GD32E113VBEVAL_TIMER_DEVPATH,
                                GD32E113VBEVAL_TIMER);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: gd32_timer_driver_setup() failed: %d\n",
             ret);
    }
#endif

#ifdef CONFIG_RTC_DRIVER
  struct rtc_lowerhalf_s *lower;

  /* Instantiate the GD32 lower-half RTC driver */

  lower = gd32_rtc_lowerhalf();
  if (lower == NULL)
    {
      syslog(LOG_ERR,
             "ERROR: Failed to instantiate the RTC lower-half driver\n");
    }
  else
    {
      /* Bind the lower half driver and register the combined RTC driver
       * as /dev/rtc0.
       */

      ret = rtc_initialize(0, lower);
      if (ret < 0)
        {
          syslog(LOG_ERR,
                 "ERROR: Failed to bind/register the RTC driver: %d\n",
                 ret);
        }
      else
        {
#  ifdef CONFIG_GD32E113VB_EVAL_RTCTEST
          gd32_rtc_test();
#  endif
        }
    }
#endif

#ifdef CONFIG_GD32E11X_USBFS
  /* Initialize USB */

  gd32_usbinitialize();
#ifdef CONFIG_USBHOST
  ret = gd32_usbhost_initialize();
  if (ret != OK)
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize USB host: %d\n", ret);
    }

#endif
#ifdef CONFIG_CUSTOM_HID
  ret = gd32_usbdev_hid_initialize();
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to initialize USB Custom HID: %d\n",
             ret);
    }
#endif
#endif

#ifdef CONFIG_EXAMPLES_CUSTOM_HID
  /* Auto-start the Custom HID example as a background task, using the same
   * priority/stack as the builtin so behaviour matches a manual launch.
   */

  ret = task_create("custom_hid", CONFIG_EXAMPLES_CUSTOM_HID_PRIORITY,
                    CONFIG_EXAMPLES_CUSTOM_HID_STACKSIZE,
                    custom_hid_main, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "ERROR: Failed to start custom_hid: %d\n", errno);
    }

#endif
  UNUSED(ret);
  return OK;
}

